Repository: anys1234/desktop-wallet
Catalog: po/*.po
Languages: fil

source: - This also can help to prove if a file has been tampered with if the SHA256 signature does not match with the one recorded on blockchain
fil: - Makatutulong ito upang patunayan kung ang isang file ay binago kung ang SHA256 na pirma ay hindi katulad ng Blockchain rekord

source: - This means that the owner of this account can prove that he had in hand this file at the block timestamp.
fil: - Ibig sabihin nito ang may-ari ng account maaaring patunayan ang pagmamay-ari ng talaksan sa oras ng pag-bloke.

source: Account added!
fil: Idinagdag ang account!

source: Account removed!
fil: Inalis ang account!

source: Account deleted!
fil: Tinanggal ang account!

source: Account successfully created:
fil: Matagumpay na nilikha ng account:

source: Account successfully imported:
fil: Matagumpay angkat ng account:

source: Cannot get registered delegates
fil: mga placeholder

source: This account already has a second passphrase:
fil: Mga placeholder

source: Voting is an optional, but important mechanism that keeps the Phantom network secure. The 51 delegates with the most votes from the network are responsible for verifying and forging transactions into new blocks. This page can be used to cast your vote for a delegate that you support.
fil: Mga placeholdet
